#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.frontend.data.aws_secretsmanager_secret.secret: Reading...
aws_route53_zone.thomaskimble_zone: Refreshing state... [id=Z06242472H0DG7GFLG30T]
module.frontend.data.aws_secretsmanager_secret.secret: Read complete after 1s [id=arn:aws:secretsmanager:eu-west-1:287212251408:secret:ThomasOliverKimble-github-aws-access-token-Smhr9D]
module.frontend.data.aws_secretsmanager_secret_version.current: Reading...
module.frontend.data.aws_secretsmanager_secret_version.current: Read complete after 0s [id=arn:aws:secretsmanager:eu-west-1:287212251408:secret:ThomasOliverKimble-github-aws-access-token-Smhr9D|AWSCURRENT]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.api.aws_api_gateway_base_path_mapping.thomaskimble_api_gateway_mapping will be created
  + resource "aws_api_gateway_base_path_mapping" "thomaskimble_api_gateway_mapping" {
      + api_id      = (known after apply)
      + domain_name = "api.thomaskimble.com"
      + id          = (known after apply)
      + stage_name  = "prod"
    }

  # module.api.aws_api_gateway_deployment.api_deployment will be created
  + resource "aws_api_gateway_deployment" "api_deployment" {
      + created_date  = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = (known after apply)
      + triggers      = (known after apply)
    }

  # module.api.aws_api_gateway_domain_name.thomaskimble_api_gateway_domain_name will be created
  + resource "aws_api_gateway_domain_name" "thomaskimble_api_gateway_domain_name" {
      + arn                                    = (known after apply)
      + certificate_upload_date                = (known after apply)
      + cloudfront_domain_name                 = (known after apply)
      + cloudfront_zone_id                     = (known after apply)
      + domain_name                            = "api.thomaskimble.com"
      + id                                     = (known after apply)
      + ownership_verification_certificate_arn = (known after apply)
      + regional_certificate_arn               = (known after apply)
      + regional_domain_name                   = (known after apply)
      + regional_zone_id                       = (known after apply)
      + security_policy                        = (known after apply)
      + tags_all                               = (known after apply)

      + endpoint_configuration {
          + types = [
              + "REGIONAL",
            ]
        }
    }

  # module.api.aws_api_gateway_integration.about_page_content_integration will be created
  + resource "aws_api_gateway_integration" "about_page_content_integration" {
      + cache_namespace      = (known after apply)
      + connection_type      = "INTERNET"
      + http_method          = "GET"
      + id                   = (known after apply)
      + passthrough_behavior = "WHEN_NO_MATCH"
      + request_templates    = {
          + "application/json" = <<-EOT
                {
                        "statusCode": 200
                      }
            EOT
        }
      + resource_id          = (known after apply)
      + rest_api_id          = (known after apply)
      + timeout_milliseconds = 29000
      + type                 = "MOCK"
    }

  # module.api.aws_api_gateway_integration_response.about_page_content_integration_response will be created
  + resource "aws_api_gateway_integration_response" "about_page_content_integration_response" {
      + http_method        = "GET"
      + id                 = (known after apply)
      + resource_id        = (known after apply)
      + response_templates = {
          + "application/json" = <<-EOT
                {
                          "title": "About Me",
                          "date": "2024-05-14T15:23:56Z",
                          "bodyClass": "page-about",
                          "sections": [
                              {
                                  "type": "text",
                                  "content": "My name is **Thomas Oliver Kimble**, an engineer with a rich blend of skills and interests, encompassing data science, robotics, cloud engineering, and a strong passion for both music and design."
                              },
                              {
                                  "type": "image",
                                  "src": "/images/about/me.jpg"
                              },
                              {
                                  "type": "header",
                                  "content": "Personal Life"
                              },
                              {
                                  "type": "text",
                                  "content": "Originally from England, I moved to Switzerland when I was three and later to France. My education was mainly in Switzerland, where I pursued engineering—a field that aligned perfectly with my passion for math, science, and design. This combination of interests led me to explore both the analytical and creative sides of my personality, particularly through music. From the age of seven, I was immersed in music, playing in bands and learning instruments like the guitar, drums, and piano."
                              }
                          ]
                      }
            EOT
        }
      + rest_api_id        = (known after apply)
      + status_code        = "200"
    }

  # module.api.aws_api_gateway_method.about_page_content_method will be created
  + resource "aws_api_gateway_method" "about_page_content_method" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "GET"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.api.aws_api_gateway_method_response.about_page_content_method_response will be created
  + resource "aws_api_gateway_method_response" "about_page_content_method_response" {
      + http_method     = "GET"
      + id              = (known after apply)
      + resource_id     = (known after apply)
      + response_models = {
          + "application/json" = "Empty"
        }
      + rest_api_id     = (known after apply)
      + status_code     = "200"
    }

  # module.api.aws_api_gateway_resource.about_page_content will be created
  + resource "aws_api_gateway_resource" "about_page_content" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "AboutPageContent"
      + rest_api_id = (known after apply)
    }

  # module.api.aws_api_gateway_rest_api.thomaskimble will be created
  + resource "aws_api_gateway_rest_api" "thomaskimble" {
      + api_key_source               = (known after apply)
      + arn                          = (known after apply)
      + binary_media_types           = (known after apply)
      + created_date                 = (known after apply)
      + description                  = (known after apply)
      + disable_execute_api_endpoint = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + minimum_compression_size     = (known after apply)
      + name                         = "thomaskimble"
      + policy                       = (known after apply)
      + root_resource_id             = (known after apply)
      + tags_all                     = (known after apply)

      + endpoint_configuration {
          + types            = [
              + "REGIONAL",
            ]
          + vpc_endpoint_ids = (known after apply)
        }
    }

  # module.api.aws_api_gateway_stage.thomaskimble_prod will be created
  + resource "aws_api_gateway_stage" "thomaskimble_prod" {
      + arn           = (known after apply)
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = (known after apply)
      + stage_name    = "prod"
      + tags_all      = (known after apply)
      + web_acl_arn   = (known after apply)
    }

  # module.domain_management.aws_acm_certificate.thomaskimble_certificate will be created
  + resource "aws_acm_certificate" "thomaskimble_certificate" {
      + arn                       = (known after apply)
      + domain_name               = "thomaskimble.com"
      + domain_validation_options = [
          + {
              + domain_name           = "*.thomaskimble.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "thomaskimble.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "*.thomaskimble.com",
          + "thomaskimble.com",
        ]
      + tags_all                  = (known after apply)
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # module.domain_management.aws_acm_certificate_validation.thomaskimble_certificate_validation will be created
  + resource "aws_acm_certificate_validation" "thomaskimble_certificate_validation" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # module.domain_management.aws_route53_record.example will be created
  + resource "aws_route53_record" "example" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "api"
      + type            = "A"
      + zone_id         = (known after apply)

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.domain_management.aws_route53_record.thomaskimble_email_secureserver_record will be created
  + resource "aws_route53_record" "thomaskimble_email_secureserver_record" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "email"
      + records         = [
          + "email.secureserver.net",
        ]
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = (known after apply)
    }

  # module.domain_management.aws_route53_record.thomaskimble_github_pages_record will be created
  + resource "aws_route53_record" "thomaskimble_github_pages_record" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "legacy"
      + records         = [
          + "thomasoliverkimble.github.io.",
        ]
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = (known after apply)
    }

  # module.domain_management.aws_route53_record.thomaskimble_outlook_autodiscover_record will be created
  + resource "aws_route53_record" "thomaskimble_outlook_autodiscover_record" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "autodiscover"
      + records         = [
          + "autodiscover.outlook.com",
        ]
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = (known after apply)
    }

  # module.domain_management.aws_route53_record.thomaskimble_outlook_mx_record will be created
  + resource "aws_route53_record" "thomaskimble_outlook_mx_record" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + records         = [
          + "0 thomaskimble-com.mail.protection.outlook.com",
        ]
      + ttl             = 300
      + type            = "MX"
      + zone_id         = (known after apply)
    }

  # module.domain_management.aws_route53_record.thomaskimble_records["*.thomaskimble.com"] will be created
  + resource "aws_route53_record" "thomaskimble_records" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = (known after apply)
    }

  # module.domain_management.aws_route53_record.thomaskimble_records["thomaskimble.com"] will be created
  + resource "aws_route53_record" "thomaskimble_records" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = (known after apply)
    }

  # module.domain_management.aws_route53_record.thomaskimble_txt_records will be created
  + resource "aws_route53_record" "thomaskimble_txt_records" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + records         = [
          + "NETORGFT11093738.onmicrosoft.com",
          + "v=spf1 include:secureserver.net -all",
        ]
      + ttl             = 300
      + type            = "TXT"
      + zone_id         = (known after apply)
    }

  # module.domain_management.aws_route53_zone.thomaskimble will be created
  + resource "aws_route53_zone" "thomaskimble" {
      + arn                 = (known after apply)
      + comment             = "Managed by Terraform"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "thomaskimble.com"
      + name_servers        = (known after apply)
      + primary_name_server = (known after apply)
      + tags_all            = (known after apply)
      + zone_id             = (known after apply)
    }

  # module.frontend.aws_amplify_app.thomaskimble_frontend will be created
  + resource "aws_amplify_app" "thomaskimble_frontend" {
      + access_token                = (sensitive value)
      + arn                         = (known after apply)
      + build_spec                  = <<-EOT
            version: 0.1
            frontend:
              phases:
                preBuild:
                    commands:
                      - npm ci
                build:
                    commands:
                      - npm run build
              artifacts:
                baseDirectory: build
                files:
                  - '**/*'
              cache:
                paths:
                  - node_modules/**/*
        EOT
      + custom_headers              = (known after apply)
      + default_domain              = (known after apply)
      + enable_branch_auto_build    = true
      + enable_branch_auto_deletion = true
      + environment_variables       = {
          + "_CUSTOM_IMAGE" = "amplify:al2"
        }
      + id                          = (known after apply)
      + name                        = "thomaskimble-frontend"
      + platform                    = "WEB"
      + production_branch           = (known after apply)
      + repository                  = "https://github.com/ThomasOliverKimble/thomaskimble-frontend"
      + tags_all                    = (known after apply)

      + custom_rule {
          + source = "</^[^.]+$|\\.(?!(css|gif|ico|jpg|js|png|txt|svg|woff|ttf|map|json)$)([^.]+$)/>"
          + status = "200"
          + target = "/index.html"
        }
      + custom_rule {
          + source = "https://thomaskimble.com"
          + status = "302"
          + target = "https://www.thomaskimble.com"
        }
    }

  # module.frontend.aws_amplify_branch.dev will be created
  + resource "aws_amplify_branch" "dev" {
      + app_id               = (known after apply)
      + arn                  = (known after apply)
      + associated_resources = (known after apply)
      + branch_name          = "dev"
      + custom_domains       = (known after apply)
      + destination_branch   = (known after apply)
      + display_name         = (known after apply)
      + enable_auto_build    = true
      + framework            = "React"
      + id                   = (known after apply)
      + source_branch        = (known after apply)
      + stage                = "DEVELOPMENT"
      + tags_all             = (known after apply)
    }

  # module.frontend.aws_amplify_branch.main will be created
  + resource "aws_amplify_branch" "main" {
      + app_id               = (known after apply)
      + arn                  = (known after apply)
      + associated_resources = (known after apply)
      + branch_name          = "main"
      + custom_domains       = (known after apply)
      + destination_branch   = (known after apply)
      + display_name         = (known after apply)
      + enable_auto_build    = true
      + framework            = "React"
      + id                   = (known after apply)
      + source_branch        = (known after apply)
      + stage                = "PRODUCTION"
      + tags_all             = (known after apply)
    }

  # module.frontend.aws_amplify_domain_association.thomaskimble will be created
  + resource "aws_amplify_domain_association" "thomaskimble" {
      + app_id                              = (known after apply)
      + arn                                 = (known after apply)
      + certificate_verification_dns_record = (known after apply)
      + domain_name                         = "thomaskimble.com"
      + enable_auto_sub_domain              = false
      + id                                  = (known after apply)
      + wait_for_verification               = false

      + sub_domain {
          + branch_name = "dev"
          + dns_record  = (known after apply)
          + prefix      = "dev"
          + verified    = (known after apply)
        }
      + sub_domain {
          + branch_name = "main"
          + dns_record  = (known after apply)
          + verified    = (known after apply)
        }
      + sub_domain {
          + branch_name = "main"
          + dns_record  = (known after apply)
          + prefix      = "www"
          + verified    = (known after apply)
        }
    }

Plan: 25 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @ThomasOliverKimble, Action: `pull_request`*